Reports/МониторТехника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>МониторТехника</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрыОтчета</Name>
					<Comment>Фильтры отчета</Comment>
					<Type>
						<v8:Type>cfg:Filter</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныеПоляОтбора</Name>
					<Comment>Доступные поля отбора</Comment>
					<Type>
						<v8:Type>cfg:CustomFields</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
					<Comment>Сохраненные настройки отчета</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автообновление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодСменыСтраниц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокНаСтраницу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Количество минут вычитаемых из даты отчета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Количество минут Прибавляемых к дате отчета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПриемку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВыдачу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМакета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Enums/СостоянияСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияСобытий</Name>
			<Comment>Состояния событий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
					<Comment>Запланировано</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
					<Comment>Выполняется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
					<Comment>Отменено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
					<Comment>Завершено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыСобытий</Name>
			<Comment>Виды событий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Анкетирование</Name>
					<Comment>Вид события анкетирования</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаАвтомобиля</Name>
					<Comment>Вид события выдачи автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаАвтомобиля</Name>
					<Comment>Вид события замены автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичнаяВстреча</Name>
					<Comment>Личная встреча</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтАвтомобиля</Name>
					<Comment>Вид события отказа от автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереуступкаАвтомобиля</Name>
					<Comment>Вид события переуступки автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтовоеПисьмо</Name>
					<Comment>Почтовое письмо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочее</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
					<Comment>Телефонный звонок</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестДрайв</Name>
					<Comment>Тест-драйв автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
					<Comment>Электронное письмо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
					<Comment>SMS событие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗвонокВежливости</Name>
					<Comment>Звонок вежливости клиенту</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаССайта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тендер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БачатаАвто</Name>
					<Comment>Событие агрегатора Бачата Авто</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОАБР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ООАБР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДополнительнаяИнформацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ДополнительнаяИнформацияАвтомобилей</Name>
			<Comment>Дополнительная информация автомобилей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Признак хозяина автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Признак пробега автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Признак государственного номера автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехПаспорт</Name>
					<Comment>Признак номера техпаспорта автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидАвтомобиля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонсигнации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаОкончанияОтсрочкиОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГаражныйНомер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретНаВнутренниеПерепродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/МониторТехника/Ext/ObjectModule.bsl
Перем Выборка Экспорт;
Перем НомерОтчета Экспорт; // 1 - приемка, 2 - выдача, 3 - не выданные
Перем ИмяОбработки Экспорт;

// расстягивает ширину колонок на заданное в форме количество раз
Функция ПромасштабироватьШирину(Область)
	Для Сч = 1 По Область.ШиринаТаблицы Цикл
		Область.Область(1,сч,1,сч).ШиринаКолонки = Область.Область(1,сч,1,сч).ШиринаКолонки * Коэффициент;
	КонецЦикла;
	Возврат Область;
КонецФункции

//Заполняет начальные настройки
//
//Без параметров
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	Если ПериодСменыСтраниц = 0 Тогда
		ПериодСменыСтраниц = 1;
	КонецЕсли;
	Если СтрокНаСтраницу = 0 Тогда
		СтрокНаСтраницу = 1;
	КонецЕсли;
	Если Коэффициент = 0 Тогда
		Коэффициент = 1;
	КонецЕсли;
	
	// фильтры
	ДоступныеПоляОтбора.Очистить();
	//ПолеНастройки=ДоступныеПоляОтбора.Добавить("Организация","Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	//ПолеНастройки.Отбор=Истина;
	ПолеНастройки=ДоступныеПоляОтбора.Добавить("Подразделение","Подразделение",Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
	ПолеНастройки.Отбор=Истина;
	ФильтрыОтчета.УстановитьДоступныеПоля(ДоступныеПоляОтбора);
	//ФильтрыОтчета.Добавить("Организация","Организация","Организация");
	ФильтрыОтчета.Добавить("Подразделение","Подразделение","Подразделение");
	ФильтрыОтчета.Подразделение.Значение = ПараметрыСеанса.Пользователь.Подразделение;
	ФильтрыОтчета.Подразделение.Использование = Истина;
	ФильтрыОтчета.Подразделение.ВидСравнения = ВидСравнения.ВИерархии;
	//ФильтрыОтчета.Организация.Значение = ПараметрыСеанса.Пользователь.Организация;
	//ФильтрыОтчета.Организация.Использование = Истина;
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

//Формирует текст запроса
//получаем все документы (Заявки) и их "рабочие места" по регистру ГрафикРаботыРесурсов из интервала [ДатаНачала ДатаКонца] и индикатор наличия ЗН 
Функция ПолучитьТекстЗапроса()
	
	// формируем строку фильтров виртуальной таблицы
	СтрокаУсловия="";
	Для Каждого ЭлементОтбора Из ФильтрыОтчета Цикл
		Если НЕ ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		СтрокаУсловия = СтрокаУсловия + " И " + СтрЗаменить(СтрЗаменить(отСформироватьСтрокуВидаСравнения(ЭлементОтбора.ВидСравнения),"#","#ИмяТаблицы#" + ЭлементОтбора.ПутьКДанным),"&","&"+ЭлементОтбора.Имя);
	КонецЦикла;
	
	СтрокаУсловия = СтрЗаменить(СтрокаУсловия, "#ИмяТаблицы#", "СобытиеКонтрагенты.Ссылка.");
	СтрокаУсловия = СтрЗаменить(СтрокаУсловия, "СобытиеКонтрагенты.Ссылка.Подразделение", "СобытиеКонтрагенты.Ссылка.ПодразделениеКомпании");
	
	
	// 1 пакет: получаем Заявки
	// 2 пакет: получаем ЗН на них
	// 3 пакет: пишем истина там где ЗН есть        
	
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СобытиеКонтрагенты.Ссылка КАК Ссылка,
	|	СобытиеКонтрагенты.Контрагент КАК Контрагент,
	|	СобытиеКонтрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ПОМЕСТИТЬ СобытиеКонтрагенты
	|ИЗ
	|	Документ.Событие.СторонниеЛица КАК СобытиеКонтрагенты
	|ГДЕ
	|	СобытиеКонтрагенты.Ссылка.ПланируемаяДатаВыдачиАвтомобиля МЕЖДУ &ДатаНачала И &ДатаОкончания
	|{ГДЕ
	|	СобытиеКонтрагенты.Ссылка.* КАК Событие,
	|	СобытиеКонтрагенты.Контрагент.* КАК Контрагент,
	|	СобытиеКонтрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация,
	|	СобытиеКонтрагенты.Ссылка.ВидСобытия КАК ВидСобытия}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Событие.ПланируемаяДатаВыдачиАвтомобиля КАК ПланируемаяДатаВыдачи,
	|	Событие.ПланируемоеВремяВыдачиАвтомобиля КАК ПланируемоеВремяВыдачи,
	|	Событие.Ссылка КАК Событие,
	|	СобытиеКонтрагенты.Контрагент КАК Контрагент,
	|	СобытиеКонтрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация,
	|	Событие.Автомобиль КАК Автомобиль,
	|	Событие.ВидСобытия КАК ВидСобытия,
	|	Событие.Автомобиль.Модель КАК Модель,
	|	Событие.Продавец КАК Менеджер,
	|	Событие.Организация,
	|	Событие.ПодразделениеКомпании,
	|	ВЫБОР
	|		КОГДА Событие.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Завершено)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Завершено,
	|	Событие.Автомобиль.VIN КАК VIN
	|ИЗ
	|	Документ.Событие КАК Событие
	|		ЛЕВОЕ СОЕДИНЕНИЕ СобытиеКонтрагенты КАК СобытиеКонтрагенты
	|		ПО Событие.Ссылка = СобытиеКонтрагенты.Ссылка
	|ГДЕ
	|	Событие.ПланируемаяДатаВыдачиАвтомобиля МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ВыдачаАвтомобиля) " + СтрокаУсловия + "  ";
	
	Возврат ТекстЗапроса;
КонецФункции //ПолучитьТекстЗапроса()

//Формирует текст запроса
//получаем все документы (Заказ-Наряды) и их статусы из интервала [ДатаНачала ДатаКонца]
Функция ПолучитьТекстЗапроса_2()
	
	// формируем строку фильтров виртуальной таблицы
	СтрокаУсловия="";
	Для Каждого ЭлементОтбора Из ФильтрыОтчета Цикл
		Если НЕ ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		СтрокаУсловия = СтрокаУсловия + " И " + СтрЗаменить(СтрЗаменить(отСформироватьСтрокуВидаСравнения(ЭлементОтбора.ВидСравнения),"#","#ИмяТаблицы#" + ЭлементОтбора.ПутьКДанным),"&","&"+ЭлементОтбора.Имя);
	КонецЦикла;
	
	СтрокаУсловия = СтрЗаменить(СтрокаУсловия, "#ИмяТаблицы#", "ЗаказНаряд.");
	СтрокаУсловия = СтрЗаменить(СтрокаУсловия, "ЗаказНаряд.Подразделение", "ЗаказНаряд.ПодразделениеКомпании");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ЗаказНаряд.Ссылка) КАК ЗаказНаряд,
	|	МАКСИМУМ(ЗаказНаряд.ПлановаяДатаВыдачи) КАК Время,
	|	МАКСИМУМ(ЗаказНаряд.Диспетчер) КАК Мастер,
	|	ЗаказНаряд.Автомобиль,
	|	ЗаказНаряд.Заказчик,
	|	ЗаказНаряд.Состояние
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.ПлановаяДатаВыдачи МЕЖДУ &ДатаНачала И &ДатаКонца " + СтрокаУсловия + "
	|	И ЗаказНаряд.Состояние <> &Состояние
	|   И   ЗаказНаряд.Заказчик <> &Заказчик
	|	И НЕ ЗаказНаряд.ПометкаУдаления
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаряд.Автомобиль,
	|	ЗаказНаряд.Заказчик,
	|	ЗаказНаряд.Состояние
	|УПОРЯДОЧИТЬ ПО
	|	Время
	|";
	
	Возврат ТекстЗапроса;
КонецФункции //ПолучитьТекстЗапроса_2()

//Формирует текст запроса
//получаем все документы (Заказ-Наряды) из интервала [НачалоДня ДатаНачала]
Функция ПолучитьТекстЗапроса_3()
	
	// формируем строку фильтров виртуальной таблицы
	СтрокаУсловия="";
	Для Каждого ЭлементОтбора Из ФильтрыОтчета Цикл
		Если НЕ ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		СтрокаУсловия = СтрокаУсловия + " И " + СтрЗаменить(СтрЗаменить(отСформироватьСтрокуВидаСравнения(ЭлементОтбора.ВидСравнения),"#","#ИмяТаблицы#" + ЭлементОтбора.ПутьКДанным),"&","&"+ЭлементОтбора.Имя);
	КонецЦикла;
	
	СтрокаУсловия = СтрЗаменить(СтрокаУсловия, "#ИмяТаблицы#", "ЗаказНаряд.");
	СтрокаУсловия = СтрЗаменить(СтрокаУсловия, "ЗаказНаряд.Подразделение", "ЗаказНаряд.ПодразделениеКомпании");
	
	// неясно что делать если несколько заказ-нарядов на 1 авто,
	// но у них разная плановая дата выдачи,
	// как тогда отслеживать, что авто просрочен, а может они вообще в разные дни?
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗаказНаряд.Ссылка КАК ЗаказНаряд,
	|	ЗаказНаряд.ПлановаяДатаВыдачи КАК Время,
	|	ЗаказНаряд.Диспетчер КАК Мастер,
	|	ЗаказНаряд.Автомобиль,
	|	ЗаказНаряд.Заказчик
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.ПлановаяДатаВыдачи МЕЖДУ &НачалоДня И &ДатаНачала " + СтрокаУсловия + "
	|	И ЗаказНаряд.Состояние <> &Состояние
	|   И   ЗаказНаряд.Заказчик <> &Заказчик
	|	И НЕ ЗаказНаряд.ПометкаУдаления";
	
	Возврат ТекстЗапроса;
КонецФункции //ПолучитьТекстЗапроса_3()

// устанавливаем параметры
Процедура ПолучитьВыборкуДанныхПриемка() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = ПолучитьТекстЗапроса();
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаОтчета - ДатаНачала * 60); // все начиная с тек время - ДатаНачала
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОтчета + ДатаКонца * 60); // до тек время + ДатаКонца
	//Запрос.УстановитьПараметр("ХозОперация", Справочники.ХозОперации.ПланРемонта);
	//Запрос.УстановитьПараметр("Состояние", Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	//Запрос.УстановитьПараметр("Заказчик", Справочники.Контрагенты.НайтиПоКоду("ЦБ000018"));
	
	Для Каждого ЭлементОтбора Из ФильтрыОтчета Цикл
		// не используем элемент отбора
		Если НЕ ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		Запрос.УстановитьПараметр(ЭлементОтбора.Имя,ЭлементОтбора.Значение);
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
КонецПроцедуры

//устанавливаем параметры
Процедура ПолучитьВыборкуДанныхВыдача() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = ПолучитьТекстЗапроса_2();
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаОтчета - ДатаНачала * 60); // все начиная с тек время - ДатаНачала
	Запрос.УстановитьПараметр("ДатаКонца", ДатаОтчета + ДатаКонца * 60); // до тек время + ДатаКонца
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ДатаОтчета)); // начало дня, для ЗН
	Запрос.УстановитьПараметр("Состояние", Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	Запрос.УстановитьПараметр("Заказчик", Справочники.Контрагенты.НайтиПоКоду("ЦБ000018"));
	
	Для Каждого ЭлементОтбора Из ФильтрыОтчета Цикл
		// не используем элемент отбора
		Если НЕ ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		Запрос.УстановитьПараметр(ЭлементОтбора.Имя,ЭлементОтбора.Значение);
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
КонецПроцедуры

//устанавливаем параметры
Процедура ПолучитьВыборкуДанныхНеВыданные() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = ПолучитьТекстЗапроса_3();
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаОтчета - ДатаНачала * 60); // все начиная с тек время - ДатаНачала
	Запрос.УстановитьПараметр("ДатаКонца", ДатаОтчета + ДатаКонца * 60); // до тек время + ДатаКонца
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ДатаОтчета)); // начало дня, для ЗН
	Запрос.УстановитьПараметр("Состояние", Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	Запрос.УстановитьПараметр("Заказчик", Справочники.Контрагенты.НайтиПоКоду("ЦБ000018"));
	
	Для Каждого ЭлементОтбора Из ФильтрыОтчета Цикл
		// не используем элемент отбора
		Если НЕ ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		Запрос.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
КонецПроцедуры

Процедура СформироватьОтчетПриемка(ТабДокумент) Экспорт 
	
	МакетОтчета = ПолучитьМакет("МакетПриемка" + ТипМакета);
	ОбластьЗаголовка = МакетОтчета.ПолучитьОбласть("Заголовок");
	
	ОбластьЗаголовка = ПромасштабироватьШирину(ОбластьЗаголовка);
	
	ОбластьЗаголовка.Параметры.Дата = Формат(ДатаОтчета,"ДФ = 'дд.ММ.гггг Ч:мм:сс'");
	//ОбластьЗаголовка.Параметры.ДеньНедели = ТРег(Формат(ДатаОтчета,"ДФ = 'дддд'"));
	
	ТабДокумент.Вывести(ОбластьЗаголовка);
	ТабДокумент.ТОлькоПРосмотр= Истина;
	ОбластьШапкаТаблицы = МакетОтчета.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьШапкаТаблицы = ПромасштабироватьШирину(ОбластьШапкаТаблицы);
	
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ДатаОтчета = ТекущаяДата();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СчетчикСтрок = 0;
	
	ОбластьСтрока = МакетОтчета.ПолучитьОбласть("Строка");
	ОбластьСтрока = ПромасштабироватьШирину(ОбластьСтрока);
	
	ОбластьЕстьЗН = МакетОтчета.ПолучитьОбласть("СтрокаЕстьВыдача");
	ОбластьЕстьЗН = ПромасштабироватьШирину(ОбластьЕстьЗН);
	
	Пока  Истина  Цикл  
		СчетчикСтрок = СчетчикСтрок + 1;
		
		Если Выборка.Завершено Тогда
			ОбластьМакета = ОбластьЕстьЗН;
			//ОбластьМакета.Параметры.Статус = Выборка.Статус ;
			
			ОбластьМакета.Параметры.Менеджер = Выборка.Менеджер;
			ОбластьМакета.Параметры.Модель = Выборка.Модель;
					ОбластьМакета.Параметры.VIN = Выборка.VIN;
         	ОбластьМакета.Параметры.Время = Выборка.ПланируемоеВремяВыдачи;

		Иначе
					ОбластьМакета = ОбластьСтрока;

			ОбластьМакета.Параметры.Менеджер = Выборка.Менеджер;
			ОбластьМакета.Параметры.Модель = Выборка.Модель;
					ОбластьМакета.Параметры.VIN = Выборка.VIN;
         	ОбластьМакета.Параметры.Время = Выборка.ПланируемоеВремяВыдачи;

			
			
		КонецЕсли;
		ОбластьМакета.Параметры.ЗР	   = Выборка.Событие;

		//
		//ОбластьМакета.Параметры.ВремяВыдачи = Выборка.ВремяВыдачи;
		//
		//Если Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.Выполнен  тогда
		//	ОбластьМакета.Параметры.Статус = "Готов";
		//	
		//КонецЕсли;  
		//Если Выборка.Статус = Справочники.ВидыСостоянийЗаказНарядов.Закрыт  тогда
		//	ОбластьМакета.Параметры.Статус = "Выдан";
		//	
		//КонецЕсли;
		//
		//ОбластьМакета.Параметры.ЗР	   = Выборка.Заявка;
		//ОбластьМакета.Параметры.Время  = Формат(Выборка.Период, "ДФ = 'Ч:мм'");
		//
		//Если ТипЗнч(Выборка.Автомобиль) = Тип("СправочникСсылка.Автомобили") Тогда
		//	ОбластьМакета.Параметры.Модель = Выборка.Автомобиль.Модель;
		//	Авто = Выборка.Автомобиль.ПолучитьОбъект();
		//	ОбластьМакета.Параметры.Номер  = Авто.ЧтениеЗначенияРегистраСведения(Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		//	ОбластьМакета.Параметры.Номер  =     Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Выборка.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,?(Выборка.ЗаказНаряд = NULL,Выборка.Заявка.Дата,Выборка.ЗаказНаряд.ДатаСоздания ));
		//Иначе
		//	ОбластьМакета.Параметры.Модель = Выборка.Автомобиль;
		//КонецЕсли;
		//
		//
				
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		Если СчетчикСтрок >= СтрокНаСтраницу Тогда
			Прервать;
		КонецЕсли;
		
		Если НЕ Выборка.Следующий() Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьОтчетВыдача(ТабДокумент) Экспорт 
	
	МакетОтчета = ПолучитьМакет("МакетВыдача" + ТипМакета);
	ОбластьЗаголовка = МакетОтчета.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовка = ПромасштабироватьШирину(ОбластьЗаголовка);
	
	ОбластьЗаголовка.Параметры.Дата = Формат(ДатаОтчета,"ДФ = 'дд.ММ.гггг Ч:мм:сс'");
	ОбластьЗаголовка.Параметры.ДеньНедели = ТРег(Формат(ДатаОтчета,"ДФ = 'дддд'"));
	
	ТабДокумент.Вывести(ОбластьЗаголовка);
	
	ОбластьШапкаТаблицы = МакетОтчета.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьШапкаТаблицы = ПромасштабироватьШирину(ОбластьШапкаТаблицы);
	
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ДатаОтчета = ТекущаяДата();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СчетчикСтрок = 0;
	
	ОбластьМакета = МакетОтчета.ПолучитьОбласть("Строка");
	ОбластьМакета = ПромасштабироватьШирину(ОбластьМакета);
	
	Пока  Истина  Цикл  
		
		СчетчикСтрок = СчетчикСтрок + 1;
		
		ОбластьМакета.Параметры.ЗН 	   = Выборка.ЗаказНаряд;
		ОбластьМакета.Параметры.Время  = Формат(Выборка.Время, "ДФ = 'Ч:мм'");
		ОбластьМакета.Параметры.Клиент = Выборка.Заказчик;
		ОбластьМакета.Параметры.Модель = Выборка.Автомобиль.Модель;
		ОбластьМакета.Параметры.Мастер = Выборка.ЗаказНаряд.Мастер;
		Если Выборка.Время > ДатаОтчета Тогда
			ОбластьМакета.Параметры.Статус = "" + Выборка.Состояние;
		Иначе
			ОбластьМакета.Параметры.Статус = "Задержан";
		КонецЕсли;
		Авто = Выборка.Автомобиль.ПолучитьОбъект();
		//ОбластьМакета.Параметры.Номер = Авто.ЧтениеЗначенияРегистраСведения(Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		ОбластьМакета.Параметры.Номер  =     Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Выборка.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,Выборка.ЗаказНаряд.ДатаСоздания);
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	КартинкиИФайлы.Идентификатор,
		|	КартинкиИФайлы.ИмяФайла,
		|	КартинкиИФайлы.Данные,
		|	КартинкиИФайлы.ДанныеВоВнешнемФайле
		|ИЗ
		|	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
		|ГДЕ
		|	КартинкиИФайлы.Объект = &ОбъектИнформации
		|	И КартинкиИФайлы.Картинка = ИСТИНА
		|АВТОУПОРЯДОЧИВАНИЕ");
		
		Попытка
			Запрос.УстановитьПараметр("ОбъектИнформации",Выборка.ЗаказНаряд.Мастер);
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			Если РезультатЗапроса.Количество()>0 Тогда			
				СтрокаКартинка = РезультатЗапроса[0];
				Если СтрокаКартинка.ДанныеВоВнешнемФайле Тогда
					ОбластьМакета.Рисунки.Фото.Картинка = Новый Картинка(СтрокаКартинка.ИмяФайла,Ложь);				
				Иначе
					ОбластьМакета.Рисунки.Фото.Картинка= СтрокаКартинка.Данные.Получить();
				КонецЕсли;			
			Иначе
				ОбластьМакета.Рисунки.Фото.Картинка = Новый Картинка;
			КонецЕсли;				
		Исключение
		КонецПопытки;
		
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		Если СчетчикСтрок >= СтрокНаСтраницу Тогда
			Прервать;
		КонецЕсли;
		
		Если НЕ Выборка.Следующий() Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьОтчетНеВыданные(ТабДокумент) Экспорт 
	
	МакетОтчета = ПолучитьМакет("МакетВыдача" + ТипМакета);
	ОбластьЗаголовка = МакетОтчета.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовка = ПромасштабироватьШирину(ОбластьЗаголовка);
	
	ОбластьЗаголовка.Параметры.Дата = Формат(ДатаОтчета,"ДФ = 'дд.ММ.гггг Ч:мм:сс'");
	ОбластьЗаголовка.Параметры.ДеньНедели = ТРег(Формат(ДатаОтчета,"ДФ = 'дддд'"));
	
	ТабДокумент.Вывести(ОбластьЗаголовка);
	
	ОбластьШапкаТаблицы = МакетОтчета.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьШапкаТаблицы = ПромасштабироватьШирину(ОбластьШапкаТаблицы);
	
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьНеВыданные = МакетОтчета.ПолучитьОбласть("ОбластьНеВыданные");
	ОбластьНеВыданные = ПромасштабироватьШирину(ОбластьНеВыданные);
	
	ТабДокумент.Вывести(ОбластьНеВыданные);
	
	ДатаОтчета = ТекущаяДата();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СчетчикСтрок = 0;
	
	ОбластьМакета = МакетОтчета.ПолучитьОбласть("Строка");
	ОбластьНеВыданные = ПромасштабироватьШирину(ОбластьНеВыданные);
	
	Пока  Истина  Цикл  
		
		СчетчикСтрок = СчетчикСтрок + 1;
		
		ОбластьМакета.Параметры.ЗН 	   = Выборка.ЗаказНаряд;
		ОбластьМакета.Параметры.Время  = "----";
		ОбластьМакета.Параметры.Клиент = Выборка.Заказчик;
		ОбластьМакета.Параметры.Модель = Выборка.Автомобиль.Модель;
		ОбластьМакета.Параметры.Мастер = Выборка.ЗаказНаряд.Мастер;
		ОбластьМакета.Параметры.Статус = "" + Выборка.ЗаказНаряд.Состояние;
		Авто = Выборка.Автомобиль.ПолучитьОбъект();
		//ОбластьМакета.Параметры.Номер  = Авто.ЧтениеЗначенияРегистраСведения(Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		ОбластьМакета.Параметры.Номер  =     Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Выборка.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,Выборка.ЗаказНаряд.ДатаСоздания);
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	КартинкиИФайлы.Идентификатор,
		|	КартинкиИФайлы.ИмяФайла,
		|	КартинкиИФайлы.Данные,
		|	КартинкиИФайлы.ДанныеВоВнешнемФайле
		|ИЗ
		|	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
		|ГДЕ
		|	КартинкиИФайлы.Объект = &ОбъектИнформации
		|	И КартинкиИФайлы.Картинка = ИСТИНА
		|АВТОУПОРЯДОЧИВАНИЕ");
		
		Попытка
			Запрос.УстановитьПараметр("ОбъектИнформации",Выборка.ЗаказНаряд.Мастер);
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			Если РезультатЗапроса.Количество()>0 Тогда			
				СтрокаКартинка = РезультатЗапроса[0];
				Если СтрокаКартинка.ДанныеВоВнешнемФайле Тогда
					ОбластьМакета.Рисунки.Фото.Картинка = Новый Картинка(СтрокаКартинка.ИмяФайла,Ложь);				
				Иначе
					ОбластьМакета.Рисунки.Фото.Картинка= СтрокаКартинка.Данные.Получить();
				КонецЕсли;			
			Иначе
				ОбластьМакета.Рисунки.Фото.Картинка = Новый Картинка;
			КонецЕсли;				
		Исключение
		КонецПопытки;
		
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		Если СчетчикСтрок >= СтрокНаСтраницу -1 Тогда
			Прервать;
		КонецЕсли;
		
		Если НЕ Выборка.Следующий() Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
